---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartBoughtOut
source: html/607fcdc1-2d95-3840-4485-25fc85cf778d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartBoughtOut Property

"Bought Out"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartBoughtOut { get; }
```